0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x8.svd
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x100</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DFIFOLVL</name>
							<description>Input/Output Data FIFO Level. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Input/Output data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_BYTE</name>
									<description>Input/Output data FIFO contains 1 byte.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_BYTES</name>
									<description>Input/Output data FIFO contains 2 bytes.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_BYTES</name>
									<description>Input/Output data FIFO contains 3 bytes.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_BYTES</name>
									<description>Input/Output data FIFO contains 4 bytes.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_BYTES</name>
									<description>Input/Output data FIFO contains 5 bytes.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BYTES</name>
									<description>Input/Output data FIFO contains 6 bytes.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BYTES</name>
									<description>Input/Output data FIFO contains 7 bytes.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BYTES</name>
									<description>Input/Output data FIFO contains 8 bytes.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BYTES</name>
									<description>Input/Output data FIFO contains 9 bytes.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BYTES</name>
									<description>Input/Output data FIFO contains 10 bytes.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11_BYTES</name>
									<description>Input/Output data FIFO contains 11 bytes.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BYTES</name>
									<description>Input/Output data FIFO contains 12 bytes.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13_BYTES</name>
									<description>Input/Output data FIFO contains 13 bytes.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14_BYTES</name>
									<description>Input/Output data FIFO contains 14 bytes.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15_BYTES</name>
									<description>Input/Output data FIFO contains 15 bytes.</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>Input/Output data FIFO contains 16 bytes (full).</description>
									<value>16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XFIFOLVL</name>
							<description>XOR Data FIFO Level. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>XOR data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_BYTE</name>
									<description>XOR data FIFO contains 1 byte.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_BYTES</name>
									<description>XOR data FIFO contains 2 bytes.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_BYTES</name>
									<description>XOR data FIFO contains 3 bytes.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_BYTES</name>
									<description>XOR data FIFO contains 4 bytes.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_BYTES</name>
									<description>XOR data FIFO contains 5 bytes.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BYTES</name>
									<description>XOR data FIFO contains 6 bytes.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BYTES</name>
									<description>XOR data FIFO contains 7 bytes.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BYTES</name>
									<description>XOR data FIFO contains 8 bytes.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BYTES</name>
									<description>XOR data FIFO contains 9 bytes.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BYTES</name>
									<description>XOR data FIFO contains 10 bytes.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11_BYTES</name>
									<description>XOR data FIFO contains 11 bytes.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BYTES</name>
									<description>XOR data FIFO contains 12 bytes.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13_BYTES</name>
									<description>XOR data FIFO contains 13 bytes.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14_BYTES</name>
									<description>XOR data FIFO contains 14 bytes.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15_BYTES</name>
									<description>XOR data FIFO contains 15 bytes.</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>XOR data FIFO contains 16 bytes (full).</description>
									<value>16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSYF</name>
							<description>Module Busy Flag. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES module is not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES module is completing an operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DURI</name>
							<description>Input/Output Data FIFO Underrun Interrupt Flag. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO underrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO underrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DORI</name>
							<description>Input/Output Data FIFO Overrun Interrupt Flag. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XORI</name>
							<description>XOR Data FIFO Overrun Interrupt Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No XOR data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An XOR data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCI</name>
							<description>Operation Complete Interrupt Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES operation complete interrupt has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES operation complete interrupt occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
